## Capstone Project Phase 1:

### Assignment 1: Build the team & other logistics \[3 Points\]

1. Find members, make team.
2. Select team lead and create one github repository per team for project.
3. Create Readme.MD file and put name of your teammates. Submit the repository link.

### Assignment 2: Pick Problem Statement & Dataset \[5 Points\]

1. Define your problem statement. (tentative, can be changed in future)
2. Find the dataset for your project.
3. Add details of problem statement & dataset link to your github readme file.

In [ ]:
link: https://github.com/priyam001/Python-Project.git

## Python Pandas Assignment:

In [11]:
# Problem: Create dataframe with custom row index & column name. The dimension should be 10x4. 
#    Custom Index should start from 101 to 110. column name should be `a` to `d`. 
#    `a` should be strings, `b` should be numbers, `c` & 'd' should be float.
#     fill up random values using numpy.random.  [4 Points]
import pandas as pd
import numpy as np

df= pd.DataFrame({'a': np.random.choice(['One', 'Five', 'Three'], 10),
                 'b':np.random.randint(1,4,10),
                 'c':np.random.uniform(1.0,4.0,10),
                 'd':np.random.uniform(1.0,4.0,10)})
    # TODO: Implement rest 3 columns 
print(df)

       a  b         c         d
0   Five  3  2.356823  2.383817
1  Three  2  3.158519  2.425340
2    One  2  1.582575  1.772738
3    One  1  2.521434  3.176768
4   Five  2  1.170697  2.871335
5  Three  2  3.339852  3.259460
6   Five  2  1.019235  1.421825
7    One  3  2.574255  1.018280
8    One  1  2.709086  1.974258
9    One  3  3.374600  1.007127

In [12]:
# Problem: Use the original dataframe to create another dataframe that has rows from index 103 to 108. [1 Points]
a=df[0:5]

'''
c=pd.DataFrame(b,index=[103,104,105,106,107,108,109])
c
'''
b=a.copy().to_string(index=False)

d=pd.Series(b, index=[100, 101, 102, 103])
d

100         a  b         c         d\n  Five  3  2.35...
101         a  b         c         d\n  Five  3  2.35...
102         a  b         c         d\n  Five  3  2.35...
103         a  b         c         d\n  Five  3  2.35...
dtype: object

In [13]:
# Problem: Use the original dataframe to create another dataframe that does not have first and last row [1 Points]
air=df

air.drop([1, 9])

       a  b         c         d
0   Five  3  2.356823  2.383817
2    One  2  1.582575  1.772738
3    One  1  2.521434  3.176768
4   Five  2  1.170697  2.871335
5  Three  2  3.339852  3.259460
6   Five  2  1.019235  1.421825
7    One  3  2.574255  1.018280
8    One  1  2.709086  1.974258

In [14]:
# Problem: Group and print orignal dataframe by column `a`
air = df.groupby(['a'])
air
for a , df in air:
    print(a)
    print(df)

Five
      a  b         c         d
0  Five  3  2.356823  2.383817
4  Five  2  1.170697  2.871335
6  Five  2  1.019235  1.421825
One
     a  b         c         d
2  One  2  1.582575  1.772738
3  One  1  2.521434  3.176768
7  One  3  2.574255  1.018280
8  One  1  2.709086  1.974258
9  One  3  3.374600  1.007127
Three
       a  b         c        d
1  Three  2  3.158519  2.42534
5  Three  2  3.339852  3.25946

In [15]:
# Problem: Use the orginal dataframe and drop first and last column [1 Points]
df.drop(['a','d'], axis = 1)

   b         c
1  2  3.158519
5  2  3.339852